#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.frontend.aws_wafv2_web_acl.waf_acl: Refreshing state... [id=4e60e6b0-61a3-4a70-9a60-4a252f3e7c7c]
module.frontend.aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E2KG39NGUA7DI2]
module.frontend.aws_acm_certificate.ssl: Refreshing state... [id=arn:aws:acm:us-east-1:529080338478:certificate/3f355d4e-762e-4305-a1de-b04e42a54abd]
module.frontend.aws_s3_bucket.bucket: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_route53_record.example["video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__03818f016c5687757483524eb672ebaa.video.rayprogramming.com._CNAME]
module.frontend.aws_route53_record.example["www.video.rayprogramming.com"]: Refreshing state... [id=Z1M325FGK1MICN__cb0ab2c26d165a5dbd01aee00ae73bee.www.video.rayprogramming.com._CNAME]
module.frontend.aws_acm_certificate_validation.ssl: Refreshing state... [id=2022-01-23 21:54:35.297 +0000 UTC]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2QZVOHCSCH69J]
module.frontend.aws_route53_record.subdomain_www[0]: Refreshing state... [id=Z1M325FGK1MICN_www.video_A]
module.frontend.aws_route53_record.subdomain_root: Refreshing state... [id=Z1M325FGK1MICN_video_A]
module.frontend.aws_s3_bucket_public_access_block.bucket_pab: Refreshing state... [id=video.rayprogramming.com]
module.frontend.aws_s3_bucket_object.frontend["index.html"]: Refreshing state... [id=index.html]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.frontend.aws_cloudfront_distribution.s3_distribution has changed
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          + cache_policy_id          = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          ~ compress                 = false -> true
          ~ default_ttl              = 3600 -> 0
          ~ max_ttl                  = 86400 -> 0
          + origin_request_policy_id = "acba4595-bd28-49b8-b9fe-13317c0390fa"
            # (8 unchanged attributes hidden)

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = false -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "none" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - logging_config {
          - bucket          = "rayprogramming-logs.s3.amazonaws.com" -> null
          - include_cookies = true -> null
          - prefix          = "video.rayprogramming.com/cdn" -> null
        }



        # (3 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["index.html"] has changed
  ~ resource "aws_s3_bucket_object" "frontend" {
      ~ etag               = "b00256700d0e30f81da136972e5b907f" -> "a657dd5b58eea9b12aecf7fc6b67d3b6"
        id                 = "index.html"
        tags               = {}
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.frontend.aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E2QZVOHCSCH69J"
        tags                           = {
            "Environment" = "video.rayprogramming.com"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl              = 0 -> 3600
          ~ max_ttl                  = 0 -> 86400
            # (11 unchanged attributes hidden)

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + bucket          = "rayprogramming-logs.s3.amazonaws.com"
          + include_cookies = true
          + prefix          = "video.rayprogramming.com/cdn"
        }



        # (3 unchanged blocks hidden)
    }

  # module.frontend.aws_s3_bucket_object.frontend["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "frontend" {
      ~ content_type       = "binary/octet-stream" -> "text/html"
      ~ etag               = "a657dd5b58eea9b12aecf7fc6b67d3b6" -> "b00256700d0e30f81da136972e5b907f"
        id                 = "index.html"
        tags               = {}
      ~ version_id         = ".3OpFi9TUy_vz2yOC.8AxJyw474WraVL" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Rihoj, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*